robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/abslayer/hal/src/stm32f1/hal_stm32_eth-lwip.c
/*
 * Copyright (C) 2011 Department of Robotics Brain and Cognitive Sciences - Istituto Italiano di Tecnologia
 * Author:  Valentina Gaggero, Marco Accame
 * email:   valentina.gaggero@iit.it, marco.accame@iit.it
 * website: www.robotcub.org
 * Permission is granted to copy, distribute, and/or modify this program
 * under the terms of the GNU General Public License, version 2 or any
 * later version published by the Free Software Foundation.
 *
 * A copy of the license can be found at
 * http://www.robotcub.org/icub/license/gpl.txt
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General
 * Public License for more details
*/


/* @file       hal_eth.c
    @brief      This file implements internal implementation of the hal eth module.
    @author     marco.accame@iit.it
    @date       05/27/2010
**/

// - modules to be built: contains the HAL_USE_* macros ---------------------------------------------------------------
#include "hal_brdcfg_modules.h"

#ifdef HAL_USE_ETH

// --------------------------------------------------------------------------------------------------------------------
// - external dependencies
// --------------------------------------------------------------------------------------------------------------------

#include "stdlib.h"
#include "stm32f1.h"
#include "string.h"
#include "hal_stm32_base_hid.h" 
#include "hal_stm32_sys_hid.h"
#include "hal_brdcfg.h"
#include "hal_switch.h"

//#define HAL_USE_EVENTVIEWER_ETH

#if defined(HAL_USE_EVENTVIEWER_ETH)
#include "eventviewer.h"
#include "hal_arch_arm.h"
#endif 

// --------------------------------------------------------------------------------------------------------------------
// - declaration of extern public interface
// --------------------------------------------------------------------------------------------------------------------

#include "hal_eth.h" 


// --------------------------------------------------------------------------------------------------------------------
// - declaration of extern hidden interface 
// --------------------------------------------------------------------------------------------------------------------

#include "hal_stm32_eth_hid.h" 


// --------------------------------------------------------------------------------------------------------------------
// - #define with internal scope
// --------------------------------------------------------------------------------------------------------------------

#include "hal_stm32_eth_def.h" 

// from NET_CONFIG.H       
//#define ETH_MTU         1514      /* Ethernet Frame Max Transfer Unit        */
//#define     STM3210C 1

// --------------------------------------------------------------------------------------------------------------------
// - definition (and initialisation) of extern variables, but better using _get(), _set() 
// --------------------------------------------------------------------------------------------------------------------
/* This variable can contain a ptr to a function that want to use a eth raw pkt (with ethernet and udp/tcp headers, etc)
   For example this function can be a parser to check a particular info in a pkt, like sequence number
   In oreder to use this variable, an external program have to declare hal_eth_lowLevelUsePacket_ptr like external and set
   to the ptr of application's function.
*/
void (*hal_eth_lowLevelUsePacket_ptr)(uint8_t* pkt_ptr, uint32_t size) = NULL;

// --------------------------------------------------------------------------------------------------------------------
// - typedef with internal scope
// --------------------------------------------------------------------------------------------------------------------

typedef uint8_t     U8;
typedef uint16_t    U16;
typedef uint32_t    U32;



typedef struct {
  uint32_t volatile Stat;
  uint32_t Ctrl;
  uint32_t Addr;
  uint32_t Next;
} hal_rx_desc_t;

typedef struct {
  uint32_t volatile CtrlStat;
  uint32_t Size;
  uint32_t Addr;
  uint32_t Next;
} hal_tx_desc_t;

typedef struct
{
    hal_eth_frame_t * (*frame_new)(uint32_t size);
    void (*frame_movetohigherlayer)(hal_eth_frame_t *frame);
    void (*frame_onrxalerthigherlayer)(void);
    void (*frame_copytohigherlayer)(uint8_t */*dma_ptr*/, uint16_t/*size*/);
    uint16_t (*frame_copyfromhigherlayer)(void *, uint8_t */*dma_ptr*/);
} hal_eth_onframerxandtx_t;

// --------------------------------------------------------------------------------------------------------------------
// - declaration of static functions
// --------------------------------------------------------------------------------------------------------------------

static hal_boolval_t s_hal_eth_supported_is(void);
static void s_hal_eth_initted_set(void);
static hal_boolval_t s_hal_eth_initted_is(void);

// keep teh same names of the tcpnet driver, without s_ prefix
static void rx_descr_init (void);
static void tx_descr_init (void);
//static void write_PHY (uint16_t PHYAddr, uint16_t PhyReg, uint16_t value);
//static uint16_t read_PHY (uint16_t PHYAddr, uint16_t PhyReg);
static void s_hal_eth_RCC_conf(void);
//static hal_result_t s_hal_eth_phyStatus_checkAndWait(uint16_t PHYAddr, uint16_t PhyReg, uint16_t checkMask);

static void s_hal_eth_rmii_init(void);

// --------------------------------------------------------------------------------------------------------------------
// - definition (and initialisation) of static variables
// --------------------------------------------------------------------------------------------------------------------


// keep teh same names of the tcpnet driver, without s_ prefix
static uint8_t RxBufIndex = 0;
static uint8_t TxBufIndex = 0;

// keep teh same names of the tcpnet driver, without s_ prefix. however, make them pointers
/* ENET local DMA buffers. */
static uint32_t (*rx_buf)[ETH_BUF_SIZE>>2] = NULL;
static uint32_t (*tx_buf)[ETH_BUF_SIZE>>2] = NULL;

// keep teh same names of the tcpnet driver, without s_ prefix. however, make them pointers
/* ENET local DMA Descriptors. */
static hal_rx_desc_t *Rx_Desc = NULL;
static hal_tx_desc_t *Tx_Desc = NULL;


// i need to initialise that with a proper value
static hal_eth_onframerxandtx_t s_onframerxtx =
{
     .frame_new                  = NULL,
     .frame_movetohigherlayer    = NULL,
//    .frame_alerthigherlayer     = NULL, 
    .frame_onrxalerthigherlayer = NULL,
    .frame_copytohigherlayer = NULL,
    .frame_copyfromhigherlayer = NULL
};

// i need to initialise that with a proper value
static uint8_t *s_hal_mac = NULL;

static const hal_eth_network_functions_t s_hal_eth_fns = 
{
    .eth_init           = hal_eth_init, 
    .eth_enable         = hal_eth_enable, 
    .eth_disable        = hal_eth_disable, 
    .eth_sendframe      = hal_eth_sendframe
};


