robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/abslayer/hal/src/stm32f1/hal_stm32_eth-lwip.c
// --------------------------------------------------------------------------------------------------------------------
// - definition of extern public functions
// --------------------------------------------------------------------------------------------------------------------
extern void ETH_IRQHandler(void);


extern hal_result_t hal_eth_init(const hal_eth_cfg_t *cfg)
{
    /* Initialize the ETH ethernet controller. */
//    uint32_t regv;
//    hal_result_t res;
//    uint8_t set_full_mode =1;
//    uint8_t set_100mb = 1;
//    uint8_t i;
//    uint8_t all_links_are_down = 1;
//    uint8_t phy_link_is_up[HAL_BRDCFG_ETH__PHY_DEVICE_NUM];

    hal_eth_onframerxandtx_t *func_onrxtx = NULL;
    
    if(hal_true != s_hal_eth_supported_is())
    {
        return(hal_res_NOK_unsupported);
    }

    if(NULL == cfg)
    {
        hal_base_hid_on_fatalerror(hal_fatalerror_incorrectparameter, "hal_eth_init() cfg is null!!!");
        return(hal_res_NOK_nullpointer);
    }

    //until ipal with tcpnet and ipal with lwip will use different hal, i use this trick in order to not change hal_eth.h
    func_onrxtx = (hal_eth_onframerxandtx_t*)cfg->onframerx;
    
    if((hal_int_priorityNONE == cfg->priority) || (NULL == func_onrxtx) || (NULL == func_onrxtx->frame_copytohigherlayer) || (NULL == func_onrxtx->frame_copyfromhigherlayer) || (NULL == cfg->macaddress))
    {
        hal_base_hid_on_fatalerror(hal_fatalerror_incorrectparameter, "hal_eth_init() needs a cfg w/ functions and mac addr and valid priority");
        return(hal_res_NOK_generic);
    }
    else
    {
        memcpy(&s_onframerxtx, func_onrxtx, sizeof(hal_eth_onframerxandtx_t));
        s_hal_mac = (uint8_t*)&(cfg->macaddress);
    }


//    eventviewer_init();
#if defined(HAL_USE_EVENTVIEWER_ETH)
    eventviewer_load(ev_ID_first_isr+hal_arch_arm_ETH_IRQn, ETH_IRQHandler);
#endif

    // this code is board-dependent
    hal_brdcfg_eth__phy_start(); 


    // code from here is common to every board
    s_hal_eth_rmii_init();

#if 0
// -----------------------------------------------------------------------------------------------------------

/*Valentina: 
ho eliminato la possibilita' di configurare i link a 10MBIT  o a 100MB o auto negoziare
in quanto questa configurazione poteva essere fatta solo a compile time definendo una macro che
ti faceva scegliere una delle 3 opzioni.
Fino ad oggi non usavamo nessuna macro quindi applicavamo la autonegoziazione.
Ma visti i problemi incontrati nella configurazione dello switch 
conviene configurare di default tutti i link a 100MB.
Ho lasciato comunque il codice per non buttarlo via...
*/


    /* Configure all PHY devices */
    #if defined (_10MBIT_)
    
    for(i=0; i< PHY_DEVICE_NUM; i++)
    {
        write_PHY (hal_brdcfg_eth__phy_device_list[i], PHY_REG_BMCR, PHY_FULLD_10M); /* Connect at 10MBit */
    }
    /* Note: I must not set any bit in ethernet register, 
       because in order to configure 10 Mbit FES bit in eTH register must be  equal to zero.  */
    
    #elif defined (_100MBIT_)
    
    for(i=0; i< HAL_BRDCFG_ETH__PHY_DEVICE_NUM; i++)
    {
        write_PHY (hal_brdcfg_eth__phy_device_list[i], PHY_REG_BMCR, PHY_FULLD_100M); /* Connect at 100MBit */
    }

    ETH->MACCR |= MCR_FES;

    #else
    /* Use autonegotiation about the link speed. */
 
    for(i=0; i< HAL_BRDCFG_ETH__PHY_DEVICE_NUM; i++)
    {
        write_PHY (hal_brdcfg_eth__phy_device_list[i], PHY_REG_BMCR, PHY_AUTO_NEG);
        res = s_hal_eth_phyStatus_checkAndWait(hal_brdcfg_eth__phy_device_list[i], PHY_REG_BMSR, HAL_ETH_AUTONEG_MASK);
        if (hal_res_OK != res)
        {
            //if autonegotiantion isn't completed then force link to 100Mb
            write_PHY (hal_brdcfg_eth__phy_device_list[i], PHY_REG_BMCR, PHY_FULLD_100M);
            //hal_on_fatalerror(hal_error_eth_cfgincorrect, "Autonegotiation incomplete\n");
            //return; //TODO: specify type of error: Autonegotiation incomplete.
        }
    }


    /* Verify link status*/
    for(i=0; i< HAL_BRDCFG_ETH__PHY_DEVICE_NUM; i++)
    {
        res = s_hal_eth_phyStatus_checkAndWait(hal_brdcfg_eth__phy_device_list[i], PHY_REG_BMSR, HAL_ETH_LINK_UP_MASK);
        if (hal_res_OK == res)
        {
            all_links_are_down &= 0x0;
            phy_link_is_up[i] = 1;
            
        }
        else
        {
             phy_link_is_up[i] = 0;
        }
    }

    /* Initialize MAC control register */
    
    
    ETH->MACCR  = MCR_ROD;  /* Receive own disable: the MAC disables the reception of frames in Half-duplex mode
                                This bit is not applicable if the MAC is operating in Full-duplex mode*/
    
    
    //if all links are down then configure eth with default values (100Mb and full duplex)
    //verify if all phy devices, which has link up, are configured in the same way
    if(!all_links_are_down)
    {
        i=0;
        while(i< HAL_BRDCFG_ETH__PHY_DEVICE_NUM)
        {
            if(phy_link_is_up[i])
            {
                regv = read_PHY (hal_brdcfg_eth__phy_device_list[i], PHY_REG_BMSR);
                set_full_mode = (set_full_mode && IS_FULL_MODE(regv)) ? 1 :0;
                set_100mb = (set_full_mode && IS_100MBIT_MODE(regv)) ? 1 :0;
            }
            i++;
        }
    }
    
    /* Configure Full/Half Duplex mode. */
    if (set_full_mode)
    {
        ETH->MACCR |= MCR_DM;
    }



    /* Configure 100MBit/10MBit mode. */
    
    if (set_100mb) 
    {
        ETH->MACCR |= MCR_FES;
    }

    //TODO: ci sarebbero altre cose da configurare....vedi stam_eth.c della ixxat.
    #endif

#endif
// --------------------------------------------------------------------------------------------------------------


    /* Ethernet MAC configuration register */
    ETH->MACCR |= MCR_FES;  //config 100Mb (Fast Eth)
    ETH->MACCR |= MCR_DM;   //config duple Mode

    
    
    /* MAC address filter register, accept multicast packets. */
    ETH->MACFFR = MFFR_HPF | MFFR_PAM;  // config Hash or perfect address filter and pass all multicast(PAM)

    /* Ethernet MAC flow control register */
    ETH->MACFCR = MFCR_ZQPD;   //Zero-quanta pause disable
    
    /* Set the Ethernet MAC Address registers */
    ETH->MACA0HR = ((U32)s_hal_mac[5] <<  8) | (U32)s_hal_mac[4];
    ETH->MACA0LR = ((U32)s_hal_mac[3] << 24) | (U32)s_hal_mac[2] << 16 | ((U32)s_hal_mac[1] <<  8) | (U32)s_hal_mac[0];
    
    /* Initialize Tx and Rx DMA Descriptors */
    rx_descr_init ();
    tx_descr_init ();
    
    /* Flush FIFO, start DMA Tx and Rx */
    ETH->DMAOMR = DOMR_FTF | DOMR_ST | DOMR_SR;
    
