robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/abslayer/hal/src/stm32f1/hal_stm32_eth-lwip.c
    /* Enable receiver and transmiter */
    ETH->MACCR |= MCR_TE | MCR_RE;
    
    /* Reset all interrupts */
    ETH->DMASR  = 0xFFFFFFFF;
    
    /* Enable Rx and Tx interrupts. */
    ETH->DMAIER = INT_NISE | INT_RIE | INT_TIE;

    // acemor on 31 oct 2011: added priority support for ETH_IRQn
    hal_sys_irqn_priority_set(ETH_IRQn, cfg->priority);


    s_hal_eth_initted_set();
    
    return(hal_res_OK);
}

extern hal_result_t hal_eth_enable(void) 
{
//     // acemor on 31 oct 2011: it is the same as NVIC_EnableIRQ(ETH_IRQn) or hal_sys_hid_irqn_enable()
//     /* Ethernet Interrupt Enable function. */
//     NVIC->ISER[1] = 1 << 29;
//     
    
    
    // for __DSB() and __ISB, see: http://infocenter.arm.com/help/index.jsp?topic=/com.arm.doc.faqs/ka13559.html
    
    //   NVIC_ClearPendingIRQ(ETH_IRQn); // shall i clear or shall i not clear? NOT CLEAR!!!
    
    NVIC_EnableIRQ(ETH_IRQn);
    __DSB();
    __ISB();
    
    // i need to force the isr if since last call of hal_eth_disable() the dma has moved a frame in the descriptor 
    // or all descriptors are owned by cpu
    if((INT_RIE == (INT_RIE & ETH->DMASR)) || (INT_RBUIE == (INT_RBUIE & ETH->DMASR)))
    {
        NVIC_SetPendingIRQ(ETH_IRQn);
    }    

    return(hal_res_OK);
}


extern hal_result_t hal_eth_disable(void) 
{
//     // acemor on 31 oct 2011: it is the same as NVIC_DisableIRQ(ETH_IRQn) or hal_sys_hid_irqn_disable()
//     /* Ethernet Interrupt Disable function. */
//     NVIC->ICER[1] = 1 << 29;
//     
    
    // for __DSB() and __ISB, see: http://infocenter.arm.com/help/index.jsp?topic=/com.arm.doc.faqs/ka13559.html
    
    NVIC_DisableIRQ(ETH_IRQn);
    __DSB();
    __ISB();

    return(hal_res_OK);
}

// changed NUM_TX_BUF with hal_base_hid_params.eth_dmatxbuffer_num
#warning different prototype of hal_eth_sendframe
//extern hal_result_t hal_eth_sendframe(void* data)
extern hal_result_t hal_eth_sendframe(hal_eth_frame_t *frame) 
{
    // called by tcpnet's send_frame(OS_FRAME *frame)
    
    // il caller passa (U32 *)&frame->data[0] e frame->length

    /* Send frame to ETH ethernet controller */
    U32 *sp,*dp;
    U32 i,j;
    U16 size = 0;
    U8 *dp_u8;
    char str[60];
    void *data = (void*)frame;
    

    if(hal_true != s_hal_eth_initted_is())
    {
        return(hal_res_NOK_generic);
    }

    j = TxBufIndex;
    /* Wait until previous packet transmitted. */
    while (Tx_Desc[j].CtrlStat & DMA_TX_OWN);
    

//     if(NULL != s_onframerx.getframefromhigherlayer)
//     {
//         uint64_t timecurr = 0;//eov_sys_LifeTimeGet(eov_sys_GetHandle());
//         sprintf(str, "hal_eth_sendframe: time=%llu", (timecurr));
//         hal_trace_puts(str);
    
    
        dp = (U32 *)(Tx_Desc[j].Addr & ~3);
        dp_u8 = (U8*)dp;
        
        Tx_Desc[j].Size = s_onframerxtx.frame_copyfromhigherlayer(data, dp_u8);
        if(0 == Tx_Desc[j].Size)
        {
            return(hal_res_NOK_nodata);
        }
//    }
//     else
//     {
//         hal_eth_frame_t *frame = (hal_eth_frame_t *)data;
//         sp = (U32 *)&frame->datafirstbyte[0];
//         dp = (U32 *)(Tx_Desc[j].Addr & ~3);

//         /* Copy frame data to ETH IO buffer. */
//         for (i = (frame->length + 3) >> 2; i; i--) {
//             *dp++ = *sp++;
//         }
//         Tx_Desc[j].Size      = frame->length;
//     }
    
    
    Tx_Desc[j].CtrlStat |= DMA_TX_OWN;
    if (++j == hal_base_hid_params.eth_dmatxbuffer_num) j = 0;
    TxBufIndex = j;
    /* Start frame transmission. */
    ETH->DMASR   = DSR_TPSS;
    ETH->DMATPDR = 0;
    return(hal_res_OK);
}



extern hal_result_t hal_eth_check_links(uint8_t *linkst_mask, uint8_t *links_num)
{
    return(hal_brdcfg_eth__check_links(linkst_mask, links_num));
}


extern hal_result_t hal_eth_get_links_status(hal_eth_phy_status_t* link_list, uint8_t links_num)
{
    return(hal_brdcfg_eth__get_links_status(link_list, links_num));
}

// --------------------------------------------------------------------------------------------------------------------
// - definition of extern hidden functions 
// --------------------------------------------------------------------------------------------------------------------

// ---- isr of the module: begin ----

void ETH_IRQHandler (void) {
  /* Ethernet Controller Interrupt function. */
//  OS_FRAME *frame; removed
  U32 i,RxLen;
  U32 *sp,*dp;
  //added 
  hal_eth_frame_t *frame; 
  uint32_t size = 0; 
    uint16_t size_u16;    
  uint8_t *sp_u8;    
    
  static uint64_t timeprev = 0;
  uint64_t timecurr;
  char str[50];
    
// sprintf(str, "hal_eth_isr 1");
// hal_trace_puts(str);
    
    
#if defined(HAL_USE_EVENTVIEWER_ETH)
  evEntityId_t prev = eventviewer_switch_to(ev_ID_first_isr+hal_arch_arm_ETH_IRQn);
#endif
  

  i = RxBufIndex;
  do {
    /* Valid frame has been received. */
    if (Rx_Desc[i].Stat & DMA_RX_ERROR_MASK) {
//         sprintf(str, "hal_eth_isr ERR A");
//         hal_trace_puts(str);
      goto rel;
    }
    if ((Rx_Desc[i].Stat & DMA_RX_SEG_MASK) != DMA_RX_SEG_MASK) {
//         sprintf(str, "hal_eth_isr ERR B, stat = 0x%x", Rx_Desc[i].Stat);
//         hal_trace_puts(str);
        goto rel;
    }
    RxLen = ((Rx_Desc[i].Stat >> 16) & 0x3FFF) - 4;
    if (RxLen > ETH_MTU) {
//               sprintf(str, "hal_eth_isr ERR C");
//         hal_trace_puts(str);
        /* Packet too big, ignore it and free buffer. */
      goto rel;
    }
    
    
          timecurr = 0;//eov_sys_LifeTimeGet(eov_sys_GetHandle());
//     sprintf(str, "hal_eth_isr before copy: time=%d", ((uint32_t)timecurr-timeprev));
//     hal_trace_puts(str);
//     timeprev = timecurr;
    
//     sprintf(str, "hal_eth_isr before copy: time=%llu", (timecurr));
//     hal_trace_puts(str);

//====> following code is sostitute with .....
//     /* Flag 0x80000000 to skip sys_error() call when out of memory. */
//     frame = alloc_mem (RxLen | 0x80000000);
//     /* if 'alloc_mem()' has failed, ignore this packet. */
//     if (frame != NULL) {
//       sp = (U32 *)(Rx_Desc[i].Addr & ~3);
//       dp = (U32 *)&frame->data[0];
//       for (RxLen = (RxLen + 3) >> 2; RxLen; RxLen--) {
//         *dp++ = *sp++;
//       }
//       put_in_queue (frame);
//     }
///====> .... this code
    
//REMOVED   !!!!
//     /* Flag 0x80000000 to skip sys_error() call when out of memory. */
//     frame = s_onframerxtx.frame_new(RxLen | 0x80000000);
//     size = (RxLen | 0x80000000);
//     /* if 'alloc_mem()' has failed, ignore this packet. */
//     if (frame != NULL) 
//     {
//         sp = (U32 *)(Rx_Desc[i].Addr & ~3);
//         dp = (U32 *)&frame->datafirstbyte[0];
//         for (RxLen = (RxLen + 3) >> 2; RxLen; RxLen--)
//         {
//             *dp++ = *sp++;
//         }
//     }

