robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/abslayer/hal/src/stm32f1/hal_stm32_eth-lwip.c
//------------------------------------
// //modificato cosi
//       /* Flag 0x80000000 to skip sys_error() call when out of memory. */
//       
//     size = (RxLen | 0x80000000);
//     size_u16 = size;
//     frame = s_onframerxtx.frame_new(size);
//     
//     sprintf(str, "hal_eth_isr RxLen=0x%x size=0x%x", RxLen, size);
//     hal_trace_puts(str);
//     /* if 'alloc_mem()' has failed, ignore this packet. */
//     if (frame != NULL) 
//     {
//         sp = (U32 *)(Rx_Desc[i].Addr & ~3);
//         dp = (U32 *)&frame->datafirstbyte[0];
//         memcpy(dp, sp,RxLen );
//     }
                
#warning da sistemare!!        
//         if(hal_eth_lowLevelUsePacket_ptr != NULL)
//         {
//             hal_eth_lowLevelUsePacket_ptr(&frame->datafirstbyte[0], size);
//         }

//REMOVED   !!!!        
//         //put_in_queue (frame);
//         s_onframerxtx.frame_movetohigherlayer(frame);

 




 //ADDED!!! call higher layer to copy received pkt
//        size = (RxLen | 0x80000000);
        sp = (U32 *)(Rx_Desc[i].Addr & ~3);
//         if(s_onframerx.frame_copytohigherlayer != NULL)
//         {
            sp_u8 = (uint8_t *)sp;
            if(hal_eth_lowLevelUsePacket_ptr != NULL)
            {
                hal_eth_lowLevelUsePacket_ptr(sp_u8, size);
            }
            s_onframerxtx.frame_copytohigherlayer(/*(U8 *)(Rx_Desc[i].Addr & ~3)*/sp_u8, RxLen);

//         }
//         else
//         {
//             frame = s_onframerx.frame_new(size);
//             /* if 'alloc_mem()' has failed, ignore this packet. */
//             if (frame != NULL)
//             {
//                 dp = (U32 *)&frame->datafirstbyte[0];
//                 for (RxLen = (RxLen + 3) >> 2; RxLen; RxLen--)
//                 {
//                     *dp++ = *sp++;
//                 }
//                 s_onframerx.frame_movetohigherlayer(frame);
//             }
//         }
        
        
        if(NULL != s_onframerxtx.frame_onrxalerthigherlayer)
        {
//             timecurr = 0; //eov_sys_LifeTimeGet(eov_sys_GetHandle());
//             sprintf(str, "hal_eth_isr alerthigherlayer: time=%llu", (timecurr));
//             hal_trace_puts(str);
            s_onframerxtx.frame_onrxalerthigherlayer();
        }
    
//     else
//     {
//         //error: memory is missing!!
//     }

        /* Release this frame from ETH IO buffer. */
rel:Rx_Desc[i].Stat = DMA_RX_OWN;

    if (++i == hal_base_hid_params.eth_dmarxbuffer_num) i = 0;
// sprintf(str, "hal_eth_isr 2");
// hal_trace_puts(str);
  } while ((Rx_Desc[i].Stat & DMA_RX_OWN) == 0);
  RxBufIndex = i;
// sprintf(str, "hal_eth_isr 3");
// hal_trace_puts(str);
  if (ETH->DMASR & INT_RBUIE) {
    /* Rx DMA suspended, resume DMA reception. */
    ETH->DMASR   = INT_RBUIE;
    ETH->DMARPDR = 0;
  }
//   sprintf(str, "hal_eth_isr 4");
//     hal_trace_puts(str);
  /* Clear the interrupt pending bits. */
  ETH->DMASR = INT_NISE | INT_RIE;


#if defined(HAL_USE_EVENTVIEWER_ETH)    
  eventviewer_switch_to(prev);
#endif
}


// ---- isr of the module: end ------


extern uint32_t hal_eth_hid_getsize(const hal_cfg_t *cfg)
{
    uint32_t size = 0;

    size += (ETH_BUF_SIZE * cfg->eth_dmarxbuffer_num);
    size += (ETH_BUF_SIZE * cfg->eth_dmatxbuffer_num);

    size += (sizeof(hal_rx_desc_t) * cfg->eth_dmarxbuffer_num);
    size += (sizeof(hal_tx_desc_t) * cfg->eth_dmatxbuffer_num); 

    return(size);
}

extern hal_result_t hal_eth_hid_setmem(const hal_cfg_t *cfg, uint32_t *memory)
{

    // removed dependency from nzi memory
    RxBufIndex = 0;
    TxBufIndex = 0;
    rx_buf = NULL;
    tx_buf = NULL;
    Rx_Desc = NULL;
    Tx_Desc = NULL;
    memset(&s_onframerxtx, 0, sizeof(s_onframerxtx));
    s_hal_mac = NULL;


    if(NULL == memory)
    {
        hal_base_hid_on_fatalerror(hal_fatalerror_missingmemory, "hal_eth_hid_setmem(): memory missing");
        return(hal_res_NOK_generic);
    }

    rx_buf = (uint32_t (*)[ETH_BUF_SIZE>>2]) memory;
    memory += ((ETH_BUF_SIZE * cfg->eth_dmarxbuffer_num)/4);
     
    tx_buf = (uint32_t (*)[ETH_BUF_SIZE>>2]) memory;
    memory += ((ETH_BUF_SIZE * cfg->eth_dmatxbuffer_num)/4);

    Rx_Desc = (hal_rx_desc_t*) memory;
    memory += ((sizeof(hal_rx_desc_t) * cfg->eth_dmarxbuffer_num)/4);

    Tx_Desc = (hal_tx_desc_t*) memory;
    memory += ((sizeof(hal_tx_desc_t) * cfg->eth_dmatxbuffer_num)/4);

    return(hal_res_OK);

}

extern const hal_eth_network_functions_t * hal_eth_get_network_functions(void)
{
    return(&s_hal_eth_fns);
}

extern void hal_eth_hid_smi_write(uint16_t PHYAddr, uint16_t PhyReg, uint16_t value)
{
    write_PHY (PHYAddr, PhyReg, value);
}

extern uint16_t hal_eth_hid_smi_read(uint16_t PHYAddr, uint16_t PhyReg)
{
    return(read_PHY (PHYAddr, PhyReg));
}

// --------------------------------------------------------------------------------------------------------------------
// - definition of static functions 
// --------------------------------------------------------------------------------------------------------------------

static hal_boolval_t s_hal_eth_supported_is(void)
{
    return(hal_base_hid_byte_bitcheck(hal_brdcfg_eth__supported_mask, 0) );
}

static void s_hal_eth_initted_set(void)
{
    //s_hal_mac = s_hal_mac;
}

static hal_boolval_t s_hal_eth_initted_is(void)
{
    return((NULL == s_hal_mac) ? (hal_false) : (hal_true));
}



// changed NUM_RX_BUF with hal_base_hid_params.eth_dmarxbuffer_num
static void rx_descr_init (void) {
  /* Initialize Receive DMA Descriptor array. */
  U32 i,next;

  RxBufIndex = 0;
    char str[30];
//     sprintf(str, "rx dma buf num: %d", hal_base_hid_params.eth_dmarxbuffer_num);
//     hal_trace_puts(str);
    
  for (i = 0, next = 0; i < hal_base_hid_params.eth_dmarxbuffer_num; i++) {
    if (++next == hal_base_hid_params.eth_dmarxbuffer_num) next = 0;
    Rx_Desc[i].Stat = DMA_RX_OWN;
    Rx_Desc[i].Ctrl = DMA_RX_RCH | ETH_BUF_SIZE;
    Rx_Desc[i].Addr = (U32)&rx_buf[i];
    Rx_Desc[i].Next = (U32)&Rx_Desc[next];
  }
  ETH->DMARDLAR = (U32)&Rx_Desc[0];
}

// changed NUM_TX_BUF with hal_base_hid_params.eth_dmatxbuffer_num
static void tx_descr_init (void) {
  /* Initialize Transmit DMA Descriptor array. */
  U32 i,next;

  TxBufIndex = 0;
  for (i = 0, next = 0; i < hal_base_hid_params.eth_dmatxbuffer_num; i++) {
    if (++next == hal_base_hid_params.eth_dmatxbuffer_num) next = 0;
    Tx_Desc[i].CtrlStat = DMA_TX_TCH | DMA_TX_LS | DMA_TX_FS;
    Tx_Desc[i].Addr     = (U32)&tx_buf[i];
    Tx_Desc[i].Next     = (U32)&Tx_Desc[next];
  }
  ETH->DMATDLAR = (U32)&Tx_Desc[0];
}

/**
  * @brief  writes @value in @PhyReg of physical addressed by @PHYAddr and
  *         waits until operation is completed for max MII_WR_TOUT.
  * @param      PHYAddr: address of physical
  *             PhyReg: address of physical's register
  *             value: value to write
  * @retval none
  */
extern void write_PHY (uint16_t PHYAddr, uint16_t PhyReg, uint16_t value)
{
    U32 tout;
    
    ETH->MACMIIDR = value;
    ETH->MACMIIAR = PHYAddr<< 11 | PhyReg << 6 | MMAR_MW | MMAR_MB;
    
