robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/abslayer/hal/src/stm32f1/hal_stm32_eth-lwip.c
    /* Wait utill operation completed */
    tout = 0;
    for (tout = 0; tout < MII_WR_TOUT; tout++)
    {
        if ((ETH->MACMIIAR & MMAR_MB) == 0)
        {
            break;
        }
    }
}

/**
  * @brief  reads @PhyReg values of physical addressed by @PHYAddr and
  *         waits until operation is completed for max MII_RD_TOUT.
  * @param      PHYAddr: address of physical
  *             PhyReg: address of physical's register
  *             value: value to write
  * @retval  @PhyReg values
  */
extern uint16_t read_PHY (uint16_t PHYAddr, uint16_t PhyReg)
{
    uint32_t tout;
    
    ETH->MACMIIAR = PHYAddr << 11 | PhyReg << 6 | MMAR_MB;
    
    /* Wait until operation completed */
    tout = 0;
    for (tout = 0; tout < MII_RD_TOUT; tout++)
    {
        if ((ETH->MACMIIAR & MMAR_MB) == 0)
        {
            break;
        }
    }
    return (ETH->MACMIIDR & MMDR_MD);
}


static void s_hal_eth_RCC_conf(void)
{

  /* Reset Ethernet MAC */
  RCC->AHBRSTR  |= 0x00004000;
  RCC->AHBRSTR  &=~0x00004000;

  /* Since eth uses pin on ports A,B,C,D then enable clock on these ports */
  RCC->APB2ENR |= 0x0000003D;

  /* Enable clock for MAC, MAC-RX and MAC-TX. */
  RCC->AHBENR  |= 0x0001C000;

}

#if 0
/**
  * @brief  checks @checkMask bitmsk is true in if @PhyReg values 
  *         of physical addressed by @PHYAddr  and
  *         waits until operation is completed for max TIMEOUT.
  * @param      PHYAddr: address of physical
  *             PhyReg: address of physical's register
  *             checkMask: bit mask
  * @retval  @PhyReg values
  */
static hal_result_t s_hal_eth_phyStatus_checkAndWait(uint16_t PHYAddr, uint16_t PhyReg, uint16_t checkMask)
{            
    uint32_t tout, regv;

    tout = 0; //reset timeout count;
    do
    {
      tout++;
      regv = read_PHY (PHYAddr, PhyReg);

    }
    while( (tout<HAL_ETH_PHY_WR_TIMEOUT) && (!(regv & checkMask)) );

    if(HAL_ETH_PHY_WR_TIMEOUT == tout)
    {
        return (hal_res_NOK_generic);
    }
    else
    {
        return(hal_res_OK);
    }


}
#endif

static void s_hal_eth_rmii_init(void)
{
/*
    Note: Ref_clock pin (A1) in initialized in  hal_brdcfg_eth__phy_start, 
    even if it belongs to rmii port.
    Its initilization must be do in phy init to provide clock to phy;
    so, in case of switch, it can work even if eth is not initilized.
*/

    /* Enable clock for Port A,B,C,D and MAC */
    s_hal_eth_RCC_conf();   //DA PROBLEMI SE E' GIA ABILITATO???

    
    /* Enable RMII and remap following pins:
    RX_DV-CRS_DV--> PD8,  RDX0-->PD9 RXD1-->PD10, RDX2-->PD11, RXD3-->PD12 */
    AFIO->MAPR   |= 0x00A00000;
    
    /* these pins must be configured in this way on all boards.
    They dipend on micro. (see table 176 of datasheet)*/
    
    /* Configure Port A ethernet pin: PA2-->MDIO */
    GPIOA->CRL   &= 0xFFFFF0FF;
    GPIOA->CRL   |= 0x00000B00;  
  
    /* Configure Port B ethernet pins: PB11 -->TXEN, PB12-->TX0, PB13-->TX1 */
    GPIOB->CRH   &= 0xFF000FFF;
    GPIOB->CRH   |= 0x00BBB000;    /*All pins are congigured in AlterFunc 50MHz*/

  
    /* Configure Port C ethernet pin: PC1-->MDC (Ethernet MIIM interface clock)*/
    GPIOC->CRL   &= 0xFFFFFF0F;
    GPIOC->CRL   |= 0x000000B0;    /*Pin 1 is congigured in AlterFunc 50MHz*/ 
         
    /* Configure Port D ethernet pins (RXD0, RXD1 AND CRSDV=CARRIER SENSE DATA VALID) */
    GPIOD->CRH   &= 0xFFFFF000;
    GPIOD->CRH   |= 0x00000444;     /*All pins are congigured reset state*/

    /* Software Reset DMA */
    ETH->DMABMR  |= DBMR_SR;
    while (ETH->DMABMR & DBMR_SR);
    
    /* Set MDC Clock range 60-72MHz. 
    MDC = Management data clock. (RMII signal)*/
    ETH->MACMIIAR = 0x00000000;

}

#endif//HAL_USE_ETH

// --------------------------------------------------------------------------------------------------------------------
// - end-of-file (leave a blank line after)
// --------------------------------------------------------------------------------------------------------------------



